[
	{ "fact": "Did you know? The first-ever computer virus was called 'Brain' and was created in 1986 by two brothers to protect their software from piracy." },
	{ "fact": "Did you know? The first computer mouse, invented in 1964, was made out of wood!" },
	{ "fact": "Did you know? Google’s first storage system was built using LEGO bricks." },
	{ "fact": "Did you know? The QWERTY keyboard was designed to slow typists down to prevent typewriters from jamming." },
	{ "fact": "Did you know? The first website ever created, info.cern.ch, is still online today!" },
	{ "fact": "Did you know? NASA still uses some 1970s computers because they are more reliable for space missions." },
	{ "fact": "Did you know? The first webcam was created just to monitor a coffee pot so researchers didn’t waste trips to an empty pot." },
	{ "fact": "Did you know? There’s a hidden dinosaur game in Google Chrome that you can play when offline!" },
	{ "fact": "Did you know? The original Windows XP startup sound was composed by Brian Eno, who had never used a PC before." },
	{ "fact": "Did you know? The world's first smartphone, the IBM Simon, was released in 1994—way before the iPhone!" },
	{ "fact": "Did you know? CAPTCHA tests were designed to stop bots, but now AI can solve most of them faster than humans." },
	{ "fact": "Did you know? The internet weighs about as much as a single strawberry, based on the electrons in motion!" },
	{ "fact": "Did you know? More than 90% of the world’s currency exists digitally and not as physical cash." },
	{ "fact": "Did you know? Amazon started out as an online bookstore before expanding into everything else." },
	{ "fact": "Did you know? The first-ever emoji was created in Japan in 1999." },
	{ "fact": "Did you know? The first email was sent by Ray Tomlinson to himself in 1971." },
	{ "fact": "Did you know? 'Robot' comes from a Czech word meaning 'forced labor' or 'slave'." },
	{ "fact": "Did you know? You can't create a folder named 'CON' in Windows due to system restrictions." },
	{ "fact": "Did you know? Apple’s first logo featured Sir Isaac Newton sitting under an apple tree." },
	{ "fact": "Did you know? Samsung was originally a grocery store before becoming a tech giant." },
	{ "fact": "Did you know? The original PlayStation was meant to be a Nintendo console, but the deal fell through." },
	{ "fact": "Did you know? The word 'password' was once the most common password in the world!" },
	{ "fact": "Did you know? A hacker once used a casino’s fish tank thermometer to gain access to their database." },
	{ "fact": "Did you know? The first 1GB hard drive was introduced in 1980 and cost $40,000!" },
	{ "fact": "Did you know? The floppy disk symbol is still used for saving files, even though most people have never used one." },
	{ "fact": "Did you know? YouTube was originally created as a video dating website before becoming the platform we know today." },
	{ "fact": "Did you know? The Windows ‘Blue Screen of Death’ used to include a sad face to make it less intimidating." },
	{ "fact": "Did you know? Netflix once tried to sell itself to Blockbuster, but Blockbuster laughed at the idea. Oops!" },
	{ "fact": "Did you know? If you type 'Google in 1998' in Google, you can see how it looked back then!" },
	{ "fact": "Did you know? The longest YouTube video ever uploaded is over 571 hours long!" },
	{ "fact": "Did you know? The Apollo 11 guidance computer had only 64KB of memory—far less than a modern smartphone!" },
	{ "fact": "Did you know? The original Space Jam website from 1996 is still online at spacejam.com!" },
	{ "fact": "Did you know? If you type 'do a barrel roll' in Google, the entire page spins!" },
	{ "fact": "Did you know? The Facebook 'Like' button was originally going to be called 'Awesome'." },
	{ "fact": "Did you know? Steve Jobs once banned his kids from using the iPad because he thought it was too addictive." },
	{ "fact": "Did you know? In 1956, a 5MB hard drive weighed over a ton and had to be transported by truck!" },
	{ "fact": "Did you know? The first computer game, 'Spacewar!', was created in 1962 by MIT students." },
	{ "fact": "Did you know? The world record for the fastest typing speed is over 200 words per minute!" },
	{ "fact": "Did you know? The term 'bug' in computing originated when a real moth was found in a computer." },
	{ "fact": "Did you know? Microsoft once had a smart AI chatbot named 'Tay' that was shut down after it started posting inappropriate tweets." },
	{ "fact": "Did you know? The 'Internet of Things' refers to smart devices that connect to the internet, like fridges and thermostats." },
	{ "fact": "Did you know? The first computer programmer was a woman—Ada Lovelace, who worked on Charles Babbage’s Analytical Engine." },
	{ "fact": "Did you know? The original iPhone didn’t have an App Store—it was added a year after launch!" },
	{ "fact": "Did you know? Typing 'askew' into Google makes the whole page tilt slightly." },
	{ "fact": "Did you know? The first Android phone, the HTC Dream, had a physical keyboard!" },
	{ "fact": "Did you know? Tesla cars have a hidden 'fart mode' in their software as an Easter egg!" },
	{ "fact": "Did you know? The Windows XP default wallpaper 'Bliss' is an actual, unedited photo taken in California." },
	{ "fact": "Did you know? Google’s name comes from the mathematical term 'googol', which is a 1 followed by 100 zeros." },
	{ "fact": "Did you know? The first digital camera was created by Kodak in 1975, and it weighed 8 pounds!" },
	{ "fact": "Did you know? The first 3D printed organ was a human bladder, successfully transplanted in 2007." },
	{ "fact": "Did you know? The first public demonstration of the computer mouse was in 1968 during the 'Mother of All Demos'." },
	{ "fact": "Did you know? The original iPod was able to hold just 1,000 songs, which seems tiny compared to today’s music libraries." },
	{ "fact": "Did you know? The 1995 JavaScript programming language was created by Brendan Eich in just 10 days." },
	{ "fact": "Did you know? The PlayStation was originally meant to be a partnership with Nintendo, but the deal fell through." },
	{ "fact": "Did you know? The term 'hack' originally referred to a clever solution, not a security breach." },
	{ "fact": "Did you know? The fastest supercomputer in the world is capable of performing over 200 quadrillion calculations per second." },
	{ "fact": "Did you know? The first touchscreen phone was the LG Prada, released in 2006, years before the iPhone." },
	{ "fact": "Did you know? The very first 'computer' was not electronic but mechanical, known as the 'Analytical Engine' created by Charles Babbage." },
	{ "fact": "Did you know? The first video game character ever created was 'Pong', back in 1972." },
	{ "fact": "Did you know? A single Google search consumes about 0.3 grams of CO2?" },
	{ "fact": "Did you know? The world’s first social media network was ‘Six Degrees’ which started in 1997." },
	{ "fact": "Did you know? The first artificial satellite, Sputnik 1, was launched by the Soviet Union in 1957 and was the size of a basketball." },
	{ "fact": "Did you know? The original IBM PC had just 16 KB of RAM, which is far less than what most smartwatches have today!" },
	{ "fact": "Did you know? The first computer virus, ‘Brain’, was designed by two Pakistani brothers who were trying to protect their software." },
	{ "fact": "Did you know? The first online purchase was made in 1994 when a man bought a CD by the band 'Sting' through the website NetMarket." },
	{ "fact": "Did you know? The fastest email ever sent was processed in less than 0.3 seconds!" },
	{ "fact": "Did you know? In 2007, Apple sold 6.1 million iPhones in the first year of its launch." },
	{ "fact": "Did you know? The very first domain name ever registered was ‘symbolics.com’ in 1985?" },
	{ "fact": "Did you know? The first Wi-Fi transmission was demonstrated by the Australian scientist John O'Sullivan in 1992." },
	{ "fact": "Did you know? The original version of Photoshop was a program called 'Display' created by Thomas and John Knoll in 1987." },
	{ "fact": "Did you know? In 1996, the first-ever video was uploaded on YouTube titled 'Me at the zoo'?" },
	{ "fact": "Did you know? IBM's Watson supercomputer once beat human champions in the game show Jeopardy in 2011?" },
	{ "fact": "Did you know? The world's first digital computer was built in 1943 and weighed over 27 tons?" },
	{ "fact": "Did you know? Google Maps was initially created as part of Google Earth in 2005." },
	{ "fact": "Did you know? The first electric computer was called 'Colossus', used during World War II to decode messages." },
	{ "fact": "Did you know? The first tablet was created in 1989 by GRiD Systems and was called the GRiDPad." }
  ]
  